{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "From Jason",
	"language": "en",
	"home_page_url": "https://fromjason.xyz/",
	"feed_url": "https://fromjason.xyz/feed/feed.json",
	"description": "A digital garden for a physical meat bag.",
	"author": {
		"name": "Jason Velazquez",
		"url": "https://fromjason.xyz/about-me/"
	},
	"items": [
		{
			"id": "https://fromjason.xyz/notebook/meta-doesn-t-hate-news-just-anything-that-moves-us-off-the-app/",
			"url": "https://fromjason.xyz/notebook/meta-doesn-t-hate-news-just-anything-that-moves-us-off-the-app/",
			"title": "Meta doesn&#39;t hate news, just anything that moves us off the app",
			"content_html": "<h1>Meta doesn't hate news, just anything that moves us off the app</h1>\n<p>Meta's vision for social media is a billion lobotomized users engaging with The Hamburglar's new value meal. To realize that vision, the conglomerate is downgrading &quot;news&quot; on its platforms.</p>\n<p><img src=\"https://fromjason.xyz/img/images/mosseri-thread.jpg\" alt=\"Instagram CEO post\">\nLink to post <a href=\"https://www.threads.net/@mosseri/post/CyPYvBhRuR6\">here</a>.</p>\n<p>Instagram CEO Adam Mosseri has taken a wishy-washy stance on news and its roll on the Threads platform. He's mentioned &quot;over promising&quot; and &quot;under delivering&quot; at least a couple of times. Whatever the hell that means, I don't buy it.</p>\n<p>Meta does not like posts that take you off its app, like ones with URLs. Like news. They never have. That's really the crux of this news situation.</p>\n<p>Facebook learned that bullying news outlets into publishing natively on <a href=\"https://www.facebook.com/formedia/blog/introducing-instant-articles\">Instant Articles</a> does not work. If it did work, and Threads could keep everyone on the app while offering breaking news coverage, the folks at Meta would be singing a different tune.</p>\n<p>Mosseri says he won't &quot;amplify&quot; news. He has yet to, as far as I'm aware, define what &quot;news&quot; is and isn't. He has not announced what &quot;amplify&quot; means, or if the opposite of that means &quot;suppress.&quot;</p>\n<p>This whole news thing is a convenient problem for Meta because now they can flag all URLs as &quot;news&quot; and suppressed it in their algorithm. Are cooking blogs considered news? Who knows.</p>\n<p>Anyway, let's all be good little users and creators who exist only to amplify Fortune 500 companies and produce content for Meta's <a href=\"https://notebook.fromjason.xyz/mind-if-i-search-your-car\">large language models</a>.</p>\n",
			"date_published": "2023-10-13T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/design-and-art/",
			"url": "https://fromjason.xyz/notebook/design-and-art/",
			"title": "Design and Art",
			"content_html": "<h1>Design &amp; art</h1>\n<p>There's a fundamental misunderstanding of what design sets to accomplish. Scrolling design-focused forums, you get the sense that design and art are viewed as interchangeable ideologies. We've somehow formed the belief that design, like art, can exist for its own sake without any consideration for function or purpose.</p>\n<p>By all accounts from great designers, this aesthete view of design is a misguided dogma.</p>\n<p>Design can absolutely be a work of art. But unlike, say, a painting, a logo design derives its beauty from function.</p>\n<p>Art may live without any justification. It is art, and its purpose is simply to exist.</p>\n<p>Design, however, must prove it is worthy of existence by demonstrating a functional ability. If design fails to meet this threshold, it is neither art nor design. It is noise.</p>\n",
			"date_published": "2023-10-13T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/interesting-finds-october-10-2023/",
			"url": "https://fromjason.xyz/notebook/interesting-finds-october-10-2023/",
			"title": "Interesting finds, October 10, 2023",
			"content_html": "<h1>Interesting finds, October 10, 2023</h1>\n<p>A few things I stumbled upon last week. No theme. Just some cool stuff.</p>\n<p><strong><a href=\"https://everynoise.com/\">Every Noise</a></strong>\nEver wonder what genre an artist belongs to? In an effort to categorize music and personalize playlists, Spotify &quot;invented&quot; a bunch of sub genres. Every Noise lets you enter an artist name and reveal the associated sub genres.</p>\n<p><strong><a href=\"https://daringfireball.net/2007/06/iphone_first_impressions\">First iPhone Impressions</a></strong>\nNoted Apple blogger and Markdown inventor John Gruber writes about his experience with the first ever iPhone in 2007.</p>\n<p><strong><a href=\"https://www.smashingmagazine.com/2020/08/autonomy-online-indieweb/\">Autonomy Online A Case For The IndieWeb</a></strong>\nName says it all. Good write up.</p>\n<p><strong><a href=\"https://twitter.com/jack/status/1012428138326851585\">Twitter founder Jack Dorsey tweets his love for the stock Notes app on iOS</a> (2018)</strong>\nNothing wrong with using notes but, I never felt the urge to evangelize Apple's most neglected bloatware. Jack seems to love it. Good for him. Maybe he can write an apology in it for selling twitter to a child.</p>\n<p><strong><a href=\"https://george.mand.is/2023/05/publishing-to-11ty-with-ia-writer-and-micropub/\">Publishing to 11ty with iA Writer and Micropub</a></strong>\nI am <em>this</em> close to building a custom blog. I've done a ton of research to find a good static blog framework and <a href=\"https://www.11ty.dev/\">11ty</a> seems to be a favorite among bespoke bloggers. Here's what appears to be a great tutorial (haven't done it yet) that explains how to set up an 11ty-powered blog and post directly from <a href=\"https://ia.net/writer\">iA Writer</a>. It's exactly what I want to do so I'm excited to try it.</p>\n",
			"date_published": "2023-10-10T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/freelance/patreon-s-new-logo-design-is-good-actually/",
			"url": "https://fromjason.xyz/freelance/patreon-s-new-logo-design-is-good-actually/",
			"title": "Patreon&#39;s new logo design is good actually",
			"content_html": "<h1>Patreon's new logo design is good actually</h1>\n<p><em>From <a href=\"https://reddit.com/r/logodesign/s/lg2YiEhKHg\">my post</a> in <a href=\"https://reddit.com/r/logodesign/s/hsCkbDSw17\">r/logodesign</a></em></p>\n<p><img src=\"https://fromjason.xyz/img/images/patreon-logo.png\" alt=\"Patreon logo\"></p>\n<p>Patreon is the latest brand to get dragged by the internet for its new logo design. At the risk of catching a few strays, I'm here to defend it, just a bit, especially in the context of this sub.</p>\n<p>Is the logo marking basically just a blob? Yes. Is the <a href=\"https://news.patreon.com/articles/patreon-redesigned\">accompanying philosophy</a> maybe a little pretentious and wacky? For sure. It reminds me of Pepsi's logo <a href=\"https://www.goldennumber.net/wp-content/uploads/pepsi-arnell-021109.pdf\">rebrand doc</a></p>\n<p>But the Patreon logo is fundamentally a good design, in my opinion (which I try my best to form using guidance from great logo designers). Here's why:</p>\n<p>It's identifiable, scalable, and highly adaptable.</p>\n<p><strong>Identifiable:</strong> The marking is as simple and solid as possible without feeling ambiguous. We might see a kidney bean now, but that will pass. Over the years, the marking will be unmistakably &quot;Patreon.&quot; Same with the custom(?) lettermark. It complements the marking but is distinct enough to stand on its own.</p>\n<p>I see so many designs here that first aim to be clever, adding unnecessary ornamentation at the expense of recall ability.</p>\n<p><strong>Scaleable</strong>: When I think of scaleability, I think of the Twitter logo. You can tell that the designers <a href=\"https://threadreaderapp.com/thread/1683266038602010624.html\">worked hard</a>on keeping its shape when small. Patreon's marking, lettermark, and combination mark are identifiable at any size. The marking will even look good as a favicon (32x32). How many logos can claim that?</p>\n<p><strong>Adaptable:</strong> Patreon's <a href=\"https://www.patreon.com/brand\">brand guide</a> covers multiple use cases for its logo. All work well. Adaptability is primarily dependent on the first two points above. For example, the ability to use the logo as a marking, icon, lettermark, and combo mark without losing its identity means it'll adapt to any medium, from an app icon to a billboard.</p>\n<p>The logo also looks good monochromatic. I don't know what they're doing with the animated blob thing, but it doesn't lose any detail as a solid color. That's important for formats that restrict the use of color, or when the logo isn't the focal point of the marketing message.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/patreon-s-new-logo-design-is-good-actually/\">#</a></h2>\n<p>Patreon's logo is just very different from the geometric outline shapes we're used to. It's solid and organic. It's anti-brutalist and anti-Scandinavian (design style, not the people.)\nMaybe it's the start of a whole new design era. Who knows. Organic shapes and ornamentation are already popping up on website designs.</p>\n<p>None of this is to say that personal taste doesn't account for anything. A logo can be fundamentally &quot;correct&quot; and still look ugly. Maybe that's the case with Patreon. But personally, if I'm aiming for anything in a design, it's the three things mentioned above. These are targets too important to miss.</p>\n",
			"date_published": "2023-10-09T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/",
			"url": "https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/",
			"title": "I guess I&#39;ll just pay til I die? Why I&#39;m switching from Ulysses to iA Writer",
			"content_html": "<h1>I guess I'll just pay til I die? Why I'm switching from Ulysses to iA Writer</h1>\n<p>I'm switching to iA Writer from Ulysses as my primary writing tool. The process has left me with some big feelings about Software as a Service (SaaS), particularly with writing apps.</p>\n<p>Admittedly, I'm a bit of a fanatic with writing apps. I see a new one, and I must try it. And I've tried them all. Fifteen or so over the past decade. So I bounce around a lot, sue me.</p>\n<h2 id=\"the-ones-i-remember\" tabindex=\"-1\">The ones I remember <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/\">#</a></h2>\n<p>A list of writing apps I've used a non-trivial amount. App Store only. In no particular order.</p>\n<ol>\n<li>Ulysses</li>\n<li>iA Writer</li>\n<li>Day One Journal</li>\n<li>Vesper (<a href=\"https://daringfireball.net/2016/08/vesper_adieu\">RIP</a>)</li>\n<li>Google Docs</li>\n<li>Apple Notes</li>\n<li>Notion</li>\n<li>Evernote</li>\n<li>Notability</li>\n<li>OneNote</li>\n<li>Final Draft</li>\n<li>Writer Duet</li>\n<li>Write.as</li>\n<li>Bear</li>\n<li>Untitled</li>\n<li>Drafts 1.0</li>\n</ol>\n<p>I've settled down in my old age, though. I've used Ulysses for three years because it's a great writing tool.</p>\n<p>My main beef with Ulysses is it doesn't save my writing in .txt files in my iCloud folder by default. It still uses my storage, of course, housing <em>my</em> files that take up space on <em>my</em> hard drive. But they hide the folder from me and manage my writing files in the Ulysses proprietary format.</p>\n<p>I know using proprietary file formats is a common practice, but it's particularly infuriating when text editors do it. It's <em>text</em>. Virtually plain text at that. Dump it all uncategorized in a single folder, I don't care. Keep your fancy file extensions if you have practical uses for it, I don't care. Just don't obstruct my ability to leave you.</p>\n<p><em>But Jason, Ulysses has an export button that allows you to save in multiple open formats in any folder you wish!</em></p>\n<p>Yes. And to be fair, I'm also now aware of the external folder feature. It took me three years of writing before discovering it, but I guess that's better than nothing. My problem is that these features are passive with a manual process. Ulysses' archival method is still hidden and proprietary. When I download a writing app, it's a tool for writing, not a method of obstructive storage (I pay Apple for that privilege.)</p>\n<p>In other words, my writing shouldn't be a function of the writing tool. The tool is a function of my writing. I could write in a text file for the rest of my life and be happy. And I'll do it, man. I can quit all these writing apps whenever I want, man.</p>\n<p>Listen, painters don't keep their art inside the house of the dude who sold them the canvas. And that canvas isn't in a proprietary— <em>I could beat this metaphor into glue</em>.</p>\n<h2 id=\"i-blame-the-saas-model\" tabindex=\"-1\">I blame the SaaS model <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/\">#</a></h2>\n<p>Is software as a service (SaaS) a better model for those who can't afford a large lump sum? Tech companies often make this claim in defense of their rent-to-never-own software. Of course, that's not the reason everything is subscription-based these days.</p>\n<p>The claim that SaaS makes the tools we need more accessible is valid in the sense that it lowers the barrier to entry. But it's not better for anyone except the companies who enjoy perpetual monthly fees. For the consumer, it means we pay more in the long term. We can then cancel and leave with nothing, or we can pay until we die.</p>\n<p>It's the boots theory in full effect.</p>\n<p>From <em>Men at Arms</em> (1993):</p>\n<blockquote>\n<p>The reason that the rich were so rich, Vimes reasoned, was because they managed to spend less money. Take boots, for example. ... A man who could afford fifty dollars had a pair of boots that'd still be keeping his feet dry in ten years' time, while a poor man who could only afford cheap boots would have spent a hundred dollars on boots in the same time and would still have wet feet.</p>\n</blockquote>\n<p>A &quot;poor man&quot; will spend more in his lifetime for a worse pair of boots than someone who can afford the upfront expense of premium footwear. SaaS models produce similar outcomes. We pay a smaller monthly fee for the implied promise of long-term, iterative software improvements. But subscription models don't incentivize companies to make better &quot;boots,&quot; just deeper moats that keep us trapped inside the service.</p>\n<p>When it's time to cancel, because we can't afford the fees, or we found a better service, we first have to cross the moat. Whether having to find a hidden cancelation process, or exporting our work one file at a time, the resulting effort feels a lot like wet feet. Ulysses has a straightforward canceling process because I subscribe via Apple's App Store, but the migration process is more cumbersome than it needs to be.</p>\n<p>SaaS models also demand perpetual growth, which means specialized tools slowly morph into &quot;everything apps.&quot; In my opinion, this is what's happening with Ulysses. Developers keep adding new features that move further from the Markdown-powered, distraction-free writing experience I value in a text editor. For example, Ulysses started hosting images in the file, requiring a proprietary file format. It's a feature aimed at new writers who are uncomfortable with Markdown, presumably. So as a monthly subscriber, it doesn't feel like I'm paying for the tool as much as I'm funding the company's future and continued growth.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/\">#</a></h2>\n<p>I don't know the answer here. Indie developers need stable revenue streams, I get that. But the subscription model isn't in users' best interests, no matter how hard companies try to <a href=\"https://medium.com/building-ulysses/why-were-switching-ulysses-to-subscription-47f80b07a9cd\">sell us</a> on it.</p>\n<p>I moved to iA Writer for two reasons:</p>\n<ol>\n<li>I already owned the apps, both iPhone and iPad. I paid in full in 2012 and then in 2017. When the time comes, I'll pay again. Offering a one-time payment option removes the temptation to keep me locked into a subscription.</li>\n<li>iA Writer respects my writings. They save my files in .txt in a folder where I have full access.</li>\n</ol>\n<p>Writing is a personal experience for me. And yeah, a lot of it is just shitty drivel. But it's <em>my</em> shitty drivel. My writings are an account of my experiences. They're records of my existence. All I ask from my writing app is to store them without obstruction, automatically and by default. Not tucked behind an app with a shiny interface. I don't think that's asking for too much.</p>\n<h3 id=\"sources-of-inspiration\" tabindex=\"-1\">Sources of inspiration <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/i-guess-i-ll-just-pay-til-i-die-why-i-m-switching-from-ulysses-to-ia-writer/\">#</a></h3>\n<p><a href=\"https://mcfunley.com/choose-boring-technology\">Choose Boring Technology</a></p>\n<p><a href=\"https://sive.rs/plaintext\">Write in Plain Text Files</a></p>\n",
			"date_published": "2023-10-09T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/stories/love-loss-and-raspberry-scones/",
			"url": "https://fromjason.xyz/stories/love-loss-and-raspberry-scones/",
			"title": "Love, Loss, &amp; Raspberry Scones",
			"content_html": "<h1>Love, Loss, &amp; Raspberry Scones</h1>\n<p>Dearest Juanita,</p>\n<p>I am currently floating through the tireless void of space.</p>\n<p>How are you?</p>\n<p>Please don't worry for me, Juanita. The stars will surely guide me home. It's just, old men with estranged hearts and muttered minds tend to grow bitter and world-weary (and melodramatic). And I have, for many years, moved around in circles and marked over squares and appeased the passing of time. What could possibly be the purpose?</p>\n<p>Oh, Juanita! The lull of the cosmos has sparked my mind into a delightful frenzy. It makes my bones feel young, and my skin glow like the stars around me. Ah yes, the stars! They sing sweet melodies for my dancing heart.</p>\n<p>Perhaps I've had too much coffee...</p>\n<p>This morning, just before the sun pierced the horizon, as I sulked in the newly ground snow, the warm scent of freshly baked scones greeted my nose. And for a moment, you and I, we, were back at the bakery on top of the hill.</p>\n<p>Remember? The one with a crow in a chef's hat above the entrance (who knew birds could bake?)</p>\n<p>We laughed at old blunders and washed down raspberry scones with hot black espresso. You wiped the beads of sweat from the bulb of my nose and smiled when my cheeks turned red.</p>\n<p>It was a moment I had lost until this morning. And now, it brings me closer to you.</p>\n<p>Last night, from a restless bed and shivering balconet, I pondered the advice of a star with two bright faces. The voices called to me, euphonious and serene.</p>\n<p>My dear Abraham, when the cold pass of time whisks you away—</p>\n<p>Seek the moments that crystallize you, like snowflakes on your window.</p>\n<p>For a time, I laid still. The darkest hours came in a rush, and with it, a bitter blue moon to bear witness. I leaned into the frigid air and humored my shining visitors, who then told me to follow the moon.</p>\n<p>I stepped from my door and into the brisk city twilight. The world felt heavy under my boots. The coupled star kept behind me, gliding from one tree to the next.</p>\n<p>It whispered chaos in my ears.</p>\n<p>Beautiful</p>\n<p>defiant</p>\n<p>chaos</p>\n<p>a mutiny against the very ground that compelled me.</p>\n<p>The world absurd, chases its beloved sun through the cosmos but forbids you to do the same?</p>\n<p>I ran down the narrow roads of the square; the violent winds lunged at each turn.</p>\n<p>And time relentless, for all its fickle demands, takes what you cherish but leaves nothing in return?</p>\n<p>I kept on through the alleyways rife with rats and wafts of rotted food. My legs were never so swift. Not even in my younger days. Though, after some distance my bones recalled their age, and I began to slow. Despair coursed through me. Was this a trick? Or had my mind finally sprung?</p>\n<p>I trekked up the hill towards the fainted moon with all I had left. And just as I reached the top, my legs flung to the sky!</p>\n<p>And my ass thumped into the snow.</p>\n<p>In a bitter tone, I yelled at the moon and the star and the crow above the entrance, who gazed down on a pitiful curmudgeon. My eyes shut tight, but could not hold back a gush of tears.</p>\n<p>For today, I am one year older and many years removed from everything I have cherished. And still, I find no purpose in a world turning without you, Juanita.</p>\n<p>When I saw us together again, bright and fearless, it gave me all I ever needed to soar over that moon and never look back. It was the feeling of new and audacious love that once blushed my face in that bakery on top of the hill.</p>\n<p>So here I am, floating across the galaxy, like a snowflake in the sky, with a box of raspberry scones under my arm (and an empty moka pot in my hand), searching for my moment.</p>\n<p>Searching for you.</p>\n<p>Yours,</p>\n<p>Abraham</p>\n",
			"date_published": "2023-10-07T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/apple-is-killing-the-cloud-as-we-know-it/",
			"url": "https://fromjason.xyz/notebook/apple-is-killing-the-cloud-as-we-know-it/",
			"title": "Apple is killing the cloud as we know it",
			"content_html": "<h1>Apple is killing the cloud as we know it</h1>\n<p>Hello. A technology novice may know that iCloud syncs their documents across all their devices— iPhone, iPad, and Mac. Someone a little more tech-savvy may understand that the cloud, as a general concept, is also used to offload computing burdens like speech-to-text and virtual assistants.</p>\n<p>We all know that our data floating in the cloud is being kept, monitored, analyzed, and sold. Tell Alexa your hopes and dreams, how perhaps you are having trouble sleeping, and he'll blab to Jeff Bezos about it. Maybe Jeff uses that gossip to sell you a better mattress.</p>\n<p>Google Assistant and Cortana (RIP) are both blabbermouths, too. It's not unreasonable to think Siri rolls with the same crowds. But I'm not so sure. Most of what you tell Siri never leaves your phone. Even for processing your voice, it's all done on your iDevice.</p>\n<p>Listen, I get it. We live in a capitalist world with faceless shareholders and petulant billionaires. Why would Apple be any different? Part of me knows that enough time passes and my foot will eventually reach my mouth. But right now, based on the information available, it's clear that Apple is killing the cloud as we know it. And it's doing so in favor of on-device computing and storage.</p>\n<p>Anything that floats in the air is encrypted and out of Tim Cook's reach. That's an incredible feat. It shows a path for tech companies to profit without soaking themselves in our data. Will Amazon or Google ever give up their data addiction? Likely not. But start-ups sprout every day.</p>\n<p>Over the last few years, Apple has favored on-device computing and encryption:</p>\n<ol>\n<li>Siri processes on-device</li>\n<li>So does dictation</li>\n<li>And the Neural Network</li>\n<li>Our files live on our devices <em>first</em></li>\n<li>All our stuff in iCloud is encrypted</li>\n</ol>\n<p>Plus, iPhones increase storage every year like clockwork. We can get 2TB mobile devices. That's wild. I mean, it's overpriced like hell, but it's still amazing.</p>\n<p>iCloud has essentially become a traffic guard that directs our digital lives from one iDevice to the next. And it never asks, &quot;How's your day, hot shot?&quot; That seems like a <em>good</em> thing.</p>\n<p><em>Note: This post is mainly rushed thoughts. I'll keep adding and polishing.</em></p>\n",
			"date_published": "2023-10-07T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/interesting-finds-oct-2-2023/",
			"url": "https://fromjason.xyz/notebook/interesting-finds-oct-2-2023/",
			"title": "Interesting finds, Oct 2, 2023",
			"content_html": "<h1>Interesting finds, Oct 2, 2023</h1>\n<p>Things I stumbled upon on the internet last week. I've been into guides and manifestos lately, so here's a few I loved. <!--more--></p>\n<p><strong><a href=\"http://wok.oblomov.eu/tecnologia/credible-threat-1/\">A credible threat to (and from) commercial social network silos/1</a></strong>\nCase against Facebook joining the Fediverse (ActivityPub). I like this essay because it touches on the concept of <a href=\"https://en.wikipedia.org/wiki/Embrace,_extend,_and_extinguish\">Embrace, Enhance, Extinguish</a>, a tactic Microsoft used in the 90s to kill open source technology.</p>\n<p><strong><a href=\"https://imgur.com/a/PiJLk\">King of the Hill Animation Style Guide</a></strong>\nA detailed best practices for animators of the show. A fascinating peek into all the work that goes into animating a classic tv show.</p>\n<p><strong><a href=\"https://idlewords.com/talks/website_obesity.htm\">The Website Obesity Crisis</a></strong>\nI can never get enough manifestos against what I like to call <em>&quot;flash and trash&quot;</em> web design.</p>\n<p><strong><a href=\"https://designmanifestos.org/noah-scalin-designers-against-monoculture/\">Designers Against Monoculture</a></strong>\nFight against corporate design sensibilities. Even has a badge you can display on your website.</p>\n<p><strong><a href=\"https://every.sdf.org/US_ASCII/Geekish/various/taco_bell.txt\">Taco Bell Programming</a></strong>\nInteresting and succinct philosophy.</p>\n",
			"date_published": "2023-10-07T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/elon-received-playbook-to-kill-twitter/",
			"url": "https://fromjason.xyz/notebook/elon-received-playbook-to-kill-twitter/",
			"title": "Elon received playbook to kill Twitter",
			"content_html": "<h1>Elon received playbook to kill Twitter</h1>\n<p>From Ben Collins for <a href=\"https://www.nbcnews.com/tech/was-elon-musks-strategy-twitter-rcna118490\">NBC</a>:</p>\n<blockquote>\n<p>Musk’s purchase of Twitter, the 3,000-word anonymous article said, would amount to a “declaration of war against the Globalist American Empire.” The sender of the texts was offering Musk, the Tesla and SpaceX CEO, a playbook for the takeover and transformation of Twitter. As the anniversary of Musk's purchase approaches, the identity of the sender remains unknown.</p>\n</blockquote>\n<p>The article Collins refers to was published by an ex-Trump staffer and texted to Elon Musk before his Twitter purchase. It outlines a strategy wishlist for destroying the platform. Such items include blaming the ADL when advertisers flee, purging the &quot;blue checks&quot; and deplatforming prominent accounts, which, the <s>article</s> text predicted, would be a &quot;battle.&quot;</p>\n<p>Ben Collins provides <a href=\"https://x.com/oneunderscore__/status/1709007318656966929?s=20\">the details</a> via video on TwitterX. In it, he asks for help revealing the person who texted Elon the article link, which is currently redacted.</p>\n<p>A friend and I often debate whether Elons actions are a deliberate attempt to kill the bird app. My friend, more reasonable than I, reminds me not to blame malice for stupidity. And he's right. Even with Collins' reporting, how do we prove intent? But man, it's <em>hard</em> not to draw conclusions. Elon is like Jack Donaghy with none of the charm, and Tucker Carlson's Twitter show is God Cop.</p>\n<p><a href=\"https://youtu.be/clPlucoobUg?si=eQsIDoKndI19-vt7\">https://youtu.be/clPlucoobUg?si=eQsIDoKndI19-vt7</a></p>\n",
			"date_published": "2023-10-07T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/freelance/some-thoughts-on-naming-your-business/",
			"url": "https://fromjason.xyz/freelance/some-thoughts-on-naming-your-business/",
			"title": "Some thoughts on naming your business",
			"content_html": "<h1>Some thoughts on naming your business</h1>\n<p>A common theme I've noticed when freelancers name their business is the name is too long--<em>way, way, way too long</em>.</p>\n<p>People want a name that describes what business they're in. I get it. I make websites and logos. My business's name is Pixel Riot.</p>\n<p>People also want an available website domain for their business name. Also, reasonable.</p>\n<p>The problem is when the business name gets so long, it hurts the logo's composition and makes it difficult to fit anywhere. The same goes for a long website address.</p>\n<p>Shorter is better.</p>\n<p>Your business name doesn't have to be so short that it falls into abstract territory, like a computer company named after a fruit. But it also shouldn't work so hard at describing your business that the name reads like a whole sentence.</p>\n<h2 id=\"entity-name-vs-dba\" tabindex=\"-1\">Entity name vs. DBA <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/some-thoughts-on-naming-your-business/\">#</a></h2>\n<p>Perhaps you're worried that your chosen name might be unavailable and the federal government will hunt you down in the middle of the night if you try registering it. And honestly, maybe they will. I'm not a lawyer, and this is not legal advice. Check your state laws.</p>\n<p>But you should know there's a difference between the name on your logo and your checks.</p>\n<p>Your <strong>entity name</strong> is how the state recognizes your business. You'll use your entity name to open a bank account, and it's what you'll see on your first check from a client.</p>\n<p>Your <strong>Doing Business As</strong> or DBA goes on your marketing materials like your website, business card, and logo.</p>\n<p>As far as I'm aware (again, check your state's laws), your entity name and DBA can be different.</p>\n<p>For example, my company's legal name is Pixel Riot Marketing Agency Augusta, LLC*. My company's DBA is simply Pixel Riot. I submitted a super long entity name to the state to reduce my chance of choosing an unavailable name, and the state subsequently rejecting my LLC application.</p>\n<p>There are websites where you can check if your name is already in use. <a href=\"https://www.northwestregisteredagent.com/start-a-business/secretary-of-state\">Here's one</a>.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/some-thoughts-on-naming-your-business/\">#</a></h2>\n<p>In short— descriptive name good, long name not so good. Do your best to find a happy medium. Or, go bold with it and name your business Pomegranate.</p>\n<p>In a future post, we'll explore the various logo types. I'll try to remember to include a section with special design considerations for a long-ass business name. All of which you can avoid if you choose a short DBA.</p>\n<h3 id=\"helpful-resources\" tabindex=\"-1\">Helpful resources: <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/some-thoughts-on-naming-your-business/\">#</a></h3>\n<ul>\n<li><a href=\"https://www.llcuniversity.com/how-to-start-an-llc\">How to form an LLC in all 50 states</a></li>\n<li><a href=\"https://namelix.com/\">Business name generator</a></li>\n<li><a href=\"https://www.northwestregisteredagent.com/start-a-business/secretary-of-state\">Business name search by state</a></li>\n<li><a href=\"https://www.sba.gov/business-guide/launch-your-business/choose-your-business-name\">How to register your business name</a></li>\n</ul>\n<p>*<em>I changed up my legal name for this post because it felt weird to post that information publicly.</em></p>\n",
			"date_published": "2023-10-04T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/freelance/write-the-worst-brand-identity-anyone-has-ever-written/",
			"url": "https://fromjason.xyz/freelance/write-the-worst-brand-identity-anyone-has-ever-written/",
			"title": "Write the worst brand identity anyone has ever written",
			"content_html": "<h1>Write the worst brand identity anyone has ever written</h1>\n<p>Take it from the king of shitty first drafts— no one ever has to know.</p>\n<p>Our <a href=\"https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/\">previous series post</a> identified three objectives for your logo design project. You can read that post first for more context if you're just joining us.</p>\n<p>Today, we'll discuss how to identify some key aspects of your business's &quot;brand identity&quot; so you can offer some guidance to your logo designer.</p>\n<h1>Your brand's identity before the logo design</h1>\n<p>Listen, you really should write up some thoughts on your brand's identity and purpose. It'll save you time, stress, and maybe even some cash. At a minimum, you'll need to share what your business does, what it sells, and a couple matters of tone and vibe to your logo designer (and everyone else for the rest of your life).</p>\n<p><em>I know, I know</em>. Sitting down to a blank computer screen, expecting to make a wholly remarkable brand out of thin air, is not what dreams are made of. I'll let you off the hook a bit and tell you that you won't get it right the first time. Hell, you probably won't get it right the fifth time. I sure didn't. But you have to start somewhere, sometime. How about right here and now with something small?</p>\n<p>Let's take 30 minutes and get that first drivel out of the way. You'll likely learn something about your business you didn't know before. And when your designer asks you their discovery questions, you won't have to start with a blank screen.</p>\n<p>I took the liberty of writing out some fun prompts that'll help you gain insight into your business without dying of boredom.</p>\n<p><em>Answer the following questions as sloppily and long-winded as you can make it:</em></p>\n<p><strong>The most annoying family member just cornered you at a holiday dinner and asked, &quot;So, what does your company do?&quot; How do you respond truthfully without encouraging follow-up questions?</strong></p>\n<hr>\n<p><strong>The New York Transit Authority called. You just won a free advertisement on the E train. How serious is your ad's tone on a scale from Vitamin Water to the CDC?</strong></p>\n<p><strong>Follow up: Which typeface do you use? Times New Roman, Helvetica, or something fun like <a href=\"https://fonts.google.com/specimen/Lobster\">Lobster</a>?</strong></p>\n<p><em>Side note: don't use lobster font for your logo. This is just an exercise, you weirdo.</em></p>\n<hr>\n<p><strong>You're setting your business up on a blind date (stay with me). What companies do you think your business would be into?</strong></p>\n<hr>\n<p><strong>Now you need to buy your business an outfit for its date. Would you shop in the men's or women's department? Or something more androgynous?</strong></p>\n<hr>\n<p><strong>Oprah called. She will buy one of every service or product you offer on grand opening day. Write out a list for her.</strong></p>\n<hr>\n<p>Write some thoughts down. Set it aside. Come back with fresh eyes and start a new draft.</p>\n<hr>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/write-the-worst-brand-identity-anyone-has-ever-written/\">#</a></h2>\n<p>This article was initially going to outline a few core concepts that will meet the three objectives from the <a href=\"https://fromjason.xyz/freelance/meet-these-three-objectives-for-a-great-freelance-logo-design\">previous post</a>. A thousand words in, I realized that the <em>entire series</em> is about meeting those three objectives. Isolating a few concepts into a single article became increasingly difficult. I kept adding sections until I was dipping into future posts I've outlined. So, I backed up a bit and limited this post to a single concept— communication.</p>\n<p>Conceptually, communicating clearly to your stakeholders is the best way to meet any objective. In the matter of logo design, that would be to your designer. Most experienced graphic designers will ask a client some discovery questions. These questions are designed to help them understand your needs, wants, and sensibilities toward design.</p>\n<p>The longer you have to mull over the answers, the better you will be at communicating your vision.</p>\n<p>Later in the series, we'll discuss the various logo &quot;types&quot; and why you can choose any one so long as it's the one I recommend.</p>\n",
			"date_published": "2023-10-03T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/",
			"url": "https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/",
			"title": "Three objectives for your logo design",
			"content_html": "<h1>Three objectives for your logo design</h1>\n<p>You're starting a new freelance business. You're excited. You're motivated. You're — <em>oh no</em>. You need a logo! Where do you start?</p>\n<p>Start here.</p>\n<p>This article will be part of a series called <em>How to Commission a Logo Design: a Guide for Non-Designers</em> (working title).</p>\n<p>Unless you're starting a graphic design business, you probably have little experience with project managing a new logo. This series aims to show you how to do that using straightforward logo design principles, so you end up with a logo that meets your needs.</p>\n<p>Today, we're identifying your objectives, or goals, for your new freelance logo. There are only three of them.</p>\n<blockquote>\n<p>“Fight against the ugliness”\n— Lella &amp; Mossimo Vignelli</p>\n</blockquote>\n<h2 id=\"your-three-logo-design-objectives\" tabindex=\"-1\">Your three logo design objectives: <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/\">#</a></h2>\n<ol>\n<li>Your logo fits neatly in a social media profile photo.</li>\n<li>Your logo's design holds up on a black and white invoice.</li>\n<li>Your logo can fit on a horizontal business card above a tagline.</li>\n</ol>\n<p><em>That's it?</em> That's it.</p>\n<p>Should your logo look cool? <em>Sure</em>. Should it pop? <em>Fine</em>. But those metrics are hard to measure. This is “Three Objectives…” not “Three Subjectives…”</p>\n<p>Also, don't get too caught up in whether or not you'll have a social media account or black-and-white invoices. These objectives are simply measures that are indicative of good design.</p>\n<h2 id=\"let-s-take-a-closer-look-at-the-objectives\" tabindex=\"-1\">Let's take a closer look at the objectives: <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/\">#</a></h2>\n<p><strong>If your logo</strong> fits neatly on a social media profile photo, that means it looks good and is identifiable on a small scale. If it looks good small, that means your logo can adapt to different <a href=\"https://www.marketingcareeredu.org/marketing-mediums/#:~:text=Marketing%20and%20promotion%20can%20take,engine%20marketing%2C%20and%20mobile%20marketing.\">mediums</a>.</p>\n<p>This is important because your logo will appear in many places with varying sizes, from mobile websites to billboards (if we're lucky).</p>\n<blockquote>\n<p>“Logos survive because they can adapt to countless formats.”\n— Sagi Haviv</p>\n</blockquote>\n<p><strong>If your logo</strong> retains its design on a black-and-white invoice, that means it can be used <a href=\"https://looka.com/logo-wiki/monochrome/\">monochromatically</a>. If your logo can be presented in just black or just white, it can identify your business in different mediums and contexts.</p>\n<p>This is important because full color may not always be preferable or even an option. You need a design you can present in one color when necessary.</p>\n<blockquote>\n<p>“Simplicity, carried to an extreme, becomes elegance.”\n— Jon Franklin</p>\n</blockquote>\n<p><strong>If your logo</strong> can fit on a traditional business card above a tagline, that means a couple of things:</p>\n<p>First, it means your logo is also horizontal, or you have a horizontal version of your logo (more on this tomorrow). If you have a horizontal logo (as opposed to stacked), that means your logo is easy to incorporate in various <a href=\"https://en.wikipedia.org/wiki/Grid_(graphic_design)\">design grids</a>.</p>\n<p>This is important because often, marketing materials designate a space for your logo in a row, not a column. Think website navigation, flyer footers, and business cards.</p>\n<p>Second, it means your logo doesn't have frivolous information baked into the design, like the year established or a catchphrase. If it doesn't have those things, it means your logo is symbolizing, not selling; punctuating, not speaking.</p>\n<p>This is important because logos that attempt to inform or sell will lose all sorts of adaptability and scaling. Your logo won't be legible when small, and you'll find you have <em>less</em> control over your marketing messages.</p>\n<p>On one side of your business card, you should have your logo front and center, with a one sentence description of your business. With a &quot;tall&quot; logo, you lose the ability to increase its size without the business card feeling crowded. With a logo that already includes a tagline, you lose control over the placement and sizing of the tagline.</p>\n<p>You also may not need a tagline with your logo in some instances. You can always add one, but its hard to remove elements permenently set in your logo.</p>\n<blockquote>\n<p>“A logo does not sell, it identifies.”\n— Paul Rand</p>\n</blockquote>\n<h2 id=\"the-exception-proves-the-rule\" tabindex=\"-1\">The exception proves the rule <a class=\"header-anchor\" href=\"https://fromjason.xyz/freelance/three-objectives-for-your-logo-design/\">#</a></h2>\n<p>I present this information and will continue offering future related tips in this series, as a matter of fact. Not because it's the only way to do things, but because I'm making two big assumptions.</p>\n<p>One, your business doesn't require you to be famed logo designer <a href=\"https://en.wikipedia.org/wiki/Saul_Bass\">Saul Bass</a>; therefore, you have little experience with logo design. Two, you don't have a quarter million dollars in the budget for your brand identity. (If you do, please email me.)</p>\n<p>And thats totally cool. You probably won't need logo design experience past your own project.</p>\n<p>New freelancers sometimes get too caught up in their logo's design. They place too much or too little importance on its role, spend too much or too little money on a design that doesn't work for them, overlook filetypes they need, or one of countless other common pitfalls I've seen in my years of logo design project management.</p>\n<p>This guide is a clear path to a successful logo project that will result in a versatile logo and get you through your first few years, at least.</p>\n",
			"date_published": "2023-10-02T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/mind-if-i-search-your-car/",
			"url": "https://fromjason.xyz/notebook/mind-if-i-search-your-car/",
			"title": "Mind if I search your car",
			"content_html": "<h1>Mind if I search your car</h1>\n<p><a href=\"https://www.reuters.com/technology/metas-new-ai-chatbot-trained-public-facebook-instagram-posts-2023-09-28/\">Reuters reporting</a> on Meta's AI chatbot and the dataset the company used to train it:</p>\n<blockquote>\n<p>Meta also did not use <strong>private chats</strong> on its messaging services as training data for the model and took steps to filter private details from public datasets used for training, said Meta President of Global Affairs Nick Clegg, speaking on the sidelines of the company's annual Connect conference this week.</p>\n</blockquote>\n<p>Emphasis mine.</p>\n<p>This is a neat little trick. A reasonable reader, or someone not completely cynical, may think the term &quot;private chat&quot; just means chats, which are private in nature.</p>\n<p>But Facebook / Meta doesn't believe chats are inherently private. Privacy is an <em>opt-in</em> feature on Messenger. You must explicitly switch on the end-to-end encryption. Only then will Meta agree to keep out of your user data.</p>\n<!--more-->\n<p>From Facebook's <a href=\"https://en-gb.facebook.com/help/messenger-app/811527538946901\">help center</a>:</p>\n<blockquote>\n<p>A secret conversation in Messenger is encrypted end to end, which means the messages are intended just for you and the other person - not anyone else, including us.</p>\n</blockquote>\n<p>So, when Nick Clegg, Meta's President of Global Affairs, goes on record to say the company's AI doesn't train on &quot;private chats,&quot; it reads like a benign statement. But, it's impossible to decipher how Clegg is using the term— as an adjective, or part of a noun with a precise technical meaning.</p>\n<p>It's possible that the term belongs to Reuters, as &quot;private chat&quot; isn't directly quoted. But I find that to be a weird liberty for a journalist to take in a published interview.</p>\n<p>Okay, I know it sounds like I'm splitting hairs but, in five years when an exposé breaks, and Zuck is invited to another congressional hearing over privacy concerns, that phrasing gives him an out.</p>\n<p>Zuck can be like &quot;we didn't mean <em>private</em>, we meant <strong>Private™</strong>. Then some congressperson with a hundred grand in Meta stock can throw up their hands and be like &quot;who's to say, case closed.&quot;</p>\n<p>I know of at least one other situation where this type of wordplay occurs.</p>\n<p>Ever been pulled over by a cop and they ask &quot;mind if I search your car?&quot; They specifically ask like this because you're likely to respond with &quot;yes&quot; or &quot;no.&quot; And because of the way the question is phrased, both potential answers can imply consent to search.</p>\n<p><em>&quot;Mind if I search your car?&quot;</em>\n<em>&quot;No.&quot;</em></p>\n<p>You may've meant &quot;no you can't search my car,&quot; but a cop can argue to a judge that they thought you meant &quot;no, I don't mind.&quot; The reverse is true with the answer yes. &quot;Yes I mind&quot; and &quot;yes I give you consent&quot; are both plausible interpretations.</p>\n<p>It's a neat little trick.</p>\n",
			"date_published": "2023-10-02T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/when-exactly-is-email-forgiveness-day/",
			"url": "https://fromjason.xyz/notebook/when-exactly-is-email-forgiveness-day/",
			"title": "When exactly is Email Forgiveness Day?",
			"content_html": "<h1>When exactly is Email Forgiveness Day?</h1>\n<p>I remember it being April 30th. In fact, I'm <a href=\"https://www.theguardian.com/technology/2016/apr/30/email-debt-forgiveness-day-unread-inbox-\">sure of it</a>. But, Gimlet Media, the company that produced the podcast where the holiday was invented <a href=\"https://gimletmedia.com/shows/reply-all/posts/edfd\">says</a> Email Forgiveness Day is September 30th. Today.</p>\n<p>Gimlet is the first on the search results for the phrase &quot;Email Forgiveness Day.&quot; The second is <a href=\"https://emaildebtforgiveness.me\">this website</a> that has what appears to be a direct quote from Alex Goldman (one of the inventors of the holiday):</p>\n<blockquote>\n<p>If there’s an email response you’ve wanted to send but been too anxious to send, you can send it on <strong>September 30th</strong>, without any apologies or explanations for all the time that has lapsed. It doesn’t matter how long it’s been. Just include a link to this explainer, the one you’re reading right now, so that your recipient knows what’s going on. Together, we can all make our inboxes less stressful.</p>\n</blockquote>\n<p>Emphasis <em>their's</em>.</p>\n<p>The attribution then links back to the Gimlet page, which doesn't mention Goldman at all.</p>\n<p>I am vaguely aware of the Reply All controversy a couple years back. Could that have something to do with it? I don't know enough to have an opinion. But, changing the date seemingly without acknowledging it seems <s>weird</s> . I'll go with <em>thoughtless</em>.</p>\n<p>Below the first and second search results are pages of old articles referencing the April 30th date for Email Forgiveness Day.</p>\n<p><em>Which day is it?</em> I need to be forgiven.</p>\n",
			"date_published": "2023-10-01T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/on-the-old-web/",
			"url": "https://fromjason.xyz/notebook/on-the-old-web/",
			"title": "On the old web",
			"content_html": "<h1>On the old web</h1>\n<p>I stayed up late last night searching for the &quot;old web&quot;— personal homepages, digital gardens, manifestos, guides— the type of stuff FAANG buried under algorithms and shiny interfaces.</p>\n<p>And boy, did I find some stuff.</p>\n<p>The old web is alive and, well, its alive at least. I have a bucket-full of bookmarks I have to sort through but, I'd like to post them here soon, under some undecided context.</p>\n<p><em>Update:</em> this is now a growing list of sites from the old web.</p>\n<h2 id=\"various-sites-from-the-old-web\" tabindex=\"-1\">Various sites from the old web <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h2>\n<p>Some of these sites haven't been updated in decades, some are still updated regularly.</p>\n<ol>\n<li>\n<p>There was <a href=\"http://www.tigerden.com/Sites/furlinks.html\">Tigerden's Big Page of Furry Links</a>, which delivers exactly what it promises (I wouldn't click on the links in that list, though. The site is twenty years old, who knows where those URLs go to now).</p>\n</li>\n<li>\n<p>There's the <a href=\"https://xanadu.com\">Project Xanadu</a> page from the folks who <em>invented</em> the concept of hyperlinks (jump-links to them). They're snarky and stubborn in their philosophy. I love it. Here's a 1995 article from Wired about their story titled <em><a href=\"https://www.wired.com/1995/06/xanadu/\">The Curse of Xanadu</a></em>. Good read.</p>\n</li>\n<li>\n<p><a href=\"http://www.stinkymeat.net/stinkymeat/day1/\">Stinkymeat</a>— A well documented three week prank.</p>\n</li>\n<li>\n<p><a href=\"http://toastytech.com/evil/\">Internet Explorer is Evil</a>— haven't read the entire site but I vibe with its premise. Wonder though if sites like this were a precursor to the Bill Gates micro-chip conspiracy theories?</p>\n</li>\n<li>\n<p><a href=\"https://beej.us/pizza/\">The Internet Pizza Server</a> is a charming little oddity. Here's the <a href=\"https://i.snap.as/N6AkQ0Vt.jpg\">pizza I ordered</a> with pepperoni, green peppers, and fingers.</p>\n</li>\n<li>\n<p>A <a href=\"https://www.metafilter.com/10034/Plane-crashes-in-to-the-word-trade-center\">forum discussing 9/11</a> as it was happening. Eerie and surreal stuff. <em>&quot;I was on the &quot;E&quot; Train, which heads straight into the WTC, only seconds before the crash, when I decided to switch to the &quot;R&quot; Train (which avoids the WTC). I would probably still be stuck on the train now, and for hours afterwards.&quot;</em></p>\n</li>\n<li>\n<p><a href=\"http://rmitz.org/bbsloser.html\">The LoserUsers</a>— I can't make heads or tails on what this site is in reference to.</p>\n</li>\n</ol>\n<h2 id=\"special-interests\" tabindex=\"-1\">Special Interests <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h2>\n<ol>\n<li>\n<p><a href=\"http://www.lostparks.com\">Lost Parks</a>— a page dedicated to all of Florida's lost tourist attractions. Started in 1997 and was updated as recent as 2015 from what I can tell</p>\n</li>\n<li>\n<p>A brief history of <a href=\"https://www.psywarrior.com/index.html\">Psychological Operations</a> from a Desert Storm Vet. A fascinating read. I couldn't find any mention of the internet as an effective medium for PSYOPs, to give you an idea how old the site is.</p>\n</li>\n<li>\n<p><a href=\"http://www.com-www.com/weirdal/\">&quot;Weird Al&quot; Yankovic Homepage</a></p>\n</li>\n</ol>\n<h2 id=\"guides-and-tutorials\" tabindex=\"-1\">Guides &amp; Tutorials <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h2>\n<p>Detailed instructions for accomplishing something.</p>\n<ol>\n<li>\n<p><a href=\"http://alumni.media.mit.edu/~mellis/cellphone/index.html\">DIY Cellphone</a> is a guide that literally shows you how to make your own cellphone, by a couple of MIT folks.</p>\n</li>\n<li>\n<p>An old <a href=\"http://www-cdr.stanford.edu/~petrie/jumpidx.htm\">HTML Tutorial</a> from Stanford with a fun writing voice. &quot;<em>...we'll share what we've learned over the months in the School of Hard Knocks. Of course, everything we tried worked...NOT!!</em>&quot;</p>\n</li>\n<li>\n<p><a href=\"http://boredmob.com/cm/coldwaterreactor/\">Cold Water Reactor</a></p>\n</li>\n<li>\n<p><a href=\"https://secretguide2pcs.tripod.com\">The SECRET Guide to Computers</a></p>\n</li>\n</ol>\n<h2 id=\"digital-repositories-collections-and-archives\" tabindex=\"-1\">Digital Repositories, Collections, &amp; Archives <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h2>\n<p>Writings, graphics, gifs, and other things made of 1s and 0s from the old web.</p>\n<ol>\n<li>\n<p><a href=\"http://cs.gettysburg.edu/~duncjo01/archive/icons/iconolog/\">Iconology</a></p>\n</li>\n<li>\n<p><a href=\"https://www.2600.com/hacked_pages/1999/1299.html\">Hacked Sites</a></p>\n</li>\n<li>\n<p><a href=\"https://www.complete-review.com/main/main.html\">Complete Review</a>— A Literary Saloon and Site Review</p>\n</li>\n<li>\n<p><a href=\"http://www.ascii-art.de\">Ascii Art Dictionary from Andreas Freise</a></p>\n</li>\n<li>\n<p><a href=\"http://diamond-back.com/icqlies.html\">Lies, Damn Lies &amp; ICQ Messages</a></p>\n</li>\n</ol>\n<h2 id=\"vintage-digital-gardens\" tabindex=\"-1\">Vintage Digital Gardens <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h2>\n<p>Personal homepages from the old internet dedicated to documenting their lives, experiences, and interests.</p>\n<ol>\n<li>\n<p><a href=\"https://www.bell-labs.com/usr/dmr/www/\">Dennis M. Ritchie</a></p>\n</li>\n<li>\n<p><a href=\"http://users.erols.com/ziring/julie.htm\">Julia A. Ziring's Home Page</a></p>\n</li>\n<li>\n<p><a href=\"http://users.erols.com/ziring/\">Ziring MicroWeb Homepage</a></p>\n</li>\n<li>\n<p><a href=\"http://www.paulburgess.org\">Paul Burgess</a></p>\n</li>\n<li>\n<p><a href=\"http://uninets.net/~blaisdel/Index.htm\">Blaisdell's Little Corner of the Web</a></p>\n</li>\n<li>\n<p><a href=\"https://sprott.physics.wisc.edu\">Sprott's Gateway</a></p>\n</li>\n<li>\n<p><a href=\"http://phil.tinsleyviaduct.com\">Phil Reynolds' Home Page</a></p>\n</li>\n<li>\n<p><a href=\"http://www.ivyjoy.com\">Ivy's Domain</a></p>\n</li>\n<li>\n<p><a href=\"http://astro.multivax.de:8000/helbig/helbig.html\">Phillip Helbig</a></p>\n</li>\n</ol>\n<h3 id=\"contact-me-about-this-list\" tabindex=\"-1\">Contact me about this list <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-the-old-web/\">#</a></h3>\n<p><a href=\"https://fromjason.xyz/how-to-reach-me/\">How to reach me</a>.</p>\n<p><strong>If a listing is harmful</strong>: While I always poke around, I haven't thoroughly reviewed all of the sites listed. If you see something listed you think is harmful, please contact me so I can remove it.</p>\n<p><strong>If you have an addition</strong>: I can't promise I'll add everything submitted, but I welcome contributions!</p>\n<p><strong>If you want your site removed</strong>: If your site is listed and you want it removed, let me know. I'll be happy to remove it.</p>\n<p><strong>If a link is broken</strong>: If you come across a broken link, let me know.</p>\n",
			"date_published": "2023-10-01T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/freelance/how-to-commission-a-logo-design-a-practical-guide-for-non-designers/",
			"url": "https://fromjason.xyz/freelance/how-to-commission-a-logo-design-a-practical-guide-for-non-designers/",
			"title": "How to Commission a Logo Design, A Practical Guide for Non-Designers",
			"content_html": "<h1>How to Commission a Logo Design: A Practical Guide for Non-Designers</h1>\n<p>If you're a freelancer starting your new business, you'll need a logo. The problem is most people don't know how to project manage a logo design. They are often left with designs that don't fit their needs and file formats they don't understand.</p>\n<p>The <em>How to Commission a Logo Design</em> series attempts to solve this problem.</p>\n",
			"date_published": "2023-10-01T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/on-digital-gardening/",
			"url": "https://fromjason.xyz/notebook/on-digital-gardening/",
			"title": "On digital gardening",
			"content_html": "<h1>On digital gardening</h1>\n<p>When I stumbled on the concept of digital gardens, it lit up my brain. It gave me a framework for something I've long tried (and failed) to accomplish with my previous blogs.</p>\n<p>My failures weren't always related to technical limitations. Though, I see now how chronological order blogs can <a href=\"https://stackingthebricks.com/how-blogs-broke-the-web/\">stifle</a> creative exploration.</p>\n<blockquote>\n<p>The phrase &quot;digital garden&quot; is a metaphor for thinking about writing and creating that focuses less on the resulting &quot;showpiece&quot; and more on the process, care, and craft it takes to get there.\n—<a href=\"https://joelhooks.com/digital-garden\">My blog is a digital garden, not a blog</a> by Joel Hooks</p>\n</blockquote>\n<p>It had more to do with a lack of permission to post anything that wasn't a stellar 1,500 word think-piece. The idea of retroactively altering my post almost felt deceptive, or even criminal. It was as if my words were evidence to a crime, and the Twitter police would break my door down if I tampered with it.</p>\n<p>Now that I have permission, and a solid framework, my vision for this project is clear, and I'm excited to <a href=\"https://fromjason.xyz\">get started</a>.</p>\n<p>I do worry that my ADHD brain will get caught up in too much &quot;pruning&quot; and not enough &quot;planting&quot;.</p>\n<p>I'd like to get rhythm going for my garden— <em>plant-plant-prune, plant-plant-prune.</em></p>\n<p><strong>Three phases for my notebook entries —</strong></p>\n<ol>\n<li><em>Note</em>: my initial knee-jerk thoughts on a subject.</li>\n<li><em>Concept</em>: a more polished and intentional write-up, with research any additional developments since my note.</li>\n<li><em>Essay</em>: An exhaustive exploration on the subject. Maybe with graphics and illustrations.</li>\n<li><em>Dead</em>: Maybe a different, less ominous word. For a &quot;dead&quot; note I could even have a &quot;petition to revive&quot; in the form of comments or direct emails. Oh, I like this.</li>\n</ol>\n<p>Structure inspired by <a href=\"https://maggieappleton.com/garden-history\">Maggie Appleton's Garden</a>.</p>\n<p>Do I keep the same page for all three phases, or start a new page and link to it?</p>\n<h2 id=\"some-unstructured-thoughts-on-structure\" tabindex=\"-1\">Some unstructured thoughts on structure <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-digital-gardening/\">#</a></h2>\n<p>I'm going all in with <a href=\"https://write.as/about\">write.as</a> for my digital garden. There are some obvious limitations (bi-directional linking, categorizing, etc.) but that's part of the appeal.</p>\n<p>I'd like a way to distinguish my external and internal hyperlinks. I think it'll keep the reader oriented. Using CSS and JavaScript for different colors seems like a potential solution.</p>\n<h3 id=\"inspirations\" tabindex=\"-1\">Inspirations: <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-digital-gardening/\">#</a></h3>\n<p>https://blog.erlend.sh/communal-bonfires\nhttps://maggieappleton.com/garden-history\nhttp://www.eastgate.com/garden/Enter.html\nhttps://stackingthebricks.com/how-blogs-broke-the-web/</p>\n<h3 id=\"bookmarks\" tabindex=\"-1\">Bookmarks <a class=\"header-anchor\" href=\"https://fromjason.xyz/notebook/on-digital-gardening/\">#</a></h3>\n<p>I made a public bookmark collection for Digital Gardens on Raindrop.io where I'll add anything I find interesting.</p>\n<iframe style=\"border: 0; width: 100%; height: 450px;\" allowfullscreen=\"\" frameborder=\"0\" src=\"https://raindrop.io/JayVee/digital-gardens-38012410/embed\"></iframe>\n",
			"date_published": "2023-09-28T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/just-one-more-technology-bro-i-promise-bro/",
			"url": "https://fromjason.xyz/notebook/just-one-more-technology-bro-i-promise-bro/",
			"title": "Just one more technology bro I promise bro",
			"content_html": "<h1>Just one more technology bro I promise bro</h1>\n<p><em>just <a href=\"https://x.com/MidTNDSA/status/1529594847459389440\">one more</a> technology and the world will be a better place, bro, for you and for me, bro.</em></p>\n<p>From <em><a href=\"https://www.inverse.com/tech/humane-projection-device-ex-apple-employees-artificial-intelligence\">How a startup full of ex-iPhone talent is trying to make phones obsolete</a></em>:</p>\n<blockquote>\n<p>Humane is trying to realize the promise of “ambient computing” — an artificial intelligence-driven computing experience that’s personal and contextual — by building a software platform and hardware line that doesn’t rely on screens.</p>\n</blockquote>\n<p>Go on...</p>\n<blockquote>\n<p>Humane was founded by Bethany Bongiorno and Imran Chaudhri, ex-Apple employees who played major roles in the creation of both the iPhone and iPad.</p>\n</blockquote>\n<p>Two ex-Apple employees who want to make a (presumably) better AI assistant than Siri? Okay, <a href=\"https://notebook.fromjason.xyz/if-apple-doesnt-fix-siri-soon-im-out\">I'm listening</a>...</p>\n<blockquote>\n<p>At Humane, their stated goal is building technology that's “familiar, natural, and human,” betters the human experience, and is “born from good intentions.” The company believes “we all deserve more from technology,”</p>\n</blockquote>\n<p>Here it comes...</p>\n<blockquote>\n<p>Chaudhri also stresses that Humane is focused on “trust and privacy from day zero.” You should have control over what your technology knows, “your data should be owned by you and only you.”</p>\n</blockquote>\n<p>Oh, fuck off lol.</p>\n<p>I'm so tired of the &quot;better tomorrow&quot; promise from snazzy tech start-ups. These &quot;privacy from day zero&quot; promises <a href=\"https://en.wikipedia.org/wiki/Don%27t_be_evil\">cannot be kept</a> in the longterm. Not if they want VC funding. Not if they want to go public. Not if they build their empire on techno-capitalism.</p>\n<p>But please, continue.</p>\n<blockquote>\n<p>the company is building screen-free ambient computing hardware, and a platform for it to run on, possibly with <strong>Android</strong> as a starting point...</p>\n</blockquote>\n<p>El Em <em>Motherfucking</em> Aye Oh.</p>\n<p>Emphasis mine.</p>\n",
			"date_published": "2023-09-15T00:00:00Z"
		}
		,
		{
			"id": "https://fromjason.xyz/notebook/he-killed-something-beautiful/",
			"url": "https://fromjason.xyz/notebook/he-killed-something-beautiful/",
			"title": "He killed something beautiful",
			"content_html": "<h1>He killed something beautiful</h1>\n<p>You know how when you push down on your feed, it refreshes? Twitter's design team invented that feature. They <em>invented</em> it; something so ubiquitous and elegant you don't even think about it.</p>\n<p>Twitter was one of the first social media companies to brand user interactions within the platform— tweets, retweets, hashtags— that was all Twitter's wildly inventive dev team.</p>\n<p>Twitter's user interface is so incredibly well-structured, with such a strong design language, that it feels as natural as the multi-touch screen it lives in. Companies, to this day, shamelessly copy everything Twitter does.</p>\n<p>When mobile websites started gaining popularity in the early 2010s, Twitter released Bootstrap, one of the first responsive front-end frameworks, for free. Today, millions of websites are built on Bootstrap because how well structured it is. I learned how to code using Bootstrap and I still use it often.</p>\n<p>Twitter has one of the best logos ever created. It’s iconic in its simplicity and thoughtfulness. It was one of the first to consider mobile interfaces, designed to be recognizable no matter the size.</p>\n<p>All this to say, to watch the brand fall victim to the antithesis of good design is gut-wrenching. I can't think of a worse death for the bird app. Elon bought something beautiful, and his instinct was to destroy it. It almost feels as if he's punishing it for achieving something he could never have achieved on his own— good taste and measured execution. You wonder if the only reason he hasn't destroyed Tesla is because he has shareholders to tell him no.</p>\n<p>I want Twitter to die. Not because of what it was, but because of what it has turned into. Twitter deserved a dignified death. Elon denied it that. He snuffed it out in the ugliest way possible.</p>\n",
			"date_published": "2023-08-23T00:00:00Z"
		}
		
	]
}
